annolet_concept.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-17 Fri 10:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>AnnoLet! Web Annotation Tool</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Raghav Mittal" />
</head>
<body>
<div id="content">
<h1 class="title">AnnoLet! Web Annotation Tool</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Use of <code>jQuery.noConflict()</code></a></li>
<li><a href="#orgheadline2">2. Calling annolet<sub>main</sub>() function</a></li>
<li><a href="#orgheadline3">3. Function <code>annolet_createContainer()</code></a></li>
<li><a href="#orgheadline6">4. Functions to retrieve and evaluate Xpath of seleceted DOM element</a>
<ul>
<li><a href="#orgheadline4">4.1. Function <code>anno_getXpath(target)</code></a></li>
<li><a href="#orgheadline5">4.2. Function <code>anno_getElementByXpath(xpath)</code></a></li>
</ul>
</li>
<li><a href="#orgheadline14">5. Selecting, highlighting and tagging an element</a>
<ul>
<li><a href="#orgheadline7">5.1. Function <code>annolet_main()</code></a></li>
<li><a href="#orgheadline8">5.2. Function <code>disableAllLinks()</code></a></li>
<li><a href="#orgheadline9">5.3. Function <code>annolet_insertIntoObject(xpath)</code></a></li>
<li><a href="#orgheadline10">5.4. Function <code>function tagObject(xpath, obj)</code></a></li>
<li><a href="#orgheadline11">5.5. Function <code>anno_highlight(xpath)</code></a></li>
<li><a href="#orgheadline13">5.6. Function <code>anno_annotate()</code></a>
<ul>
<li><a href="#orgheadline12">5.6.1. <i>not complete</i></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The source is written in JavaScript and jQuery 1.7 is used in it. I am trying to make it more scalable and robust, 
so that it can be easily integrated with other projects.
</p>

<p>
To run this program call <code>annolet_main()</code> function.
</p>
<hr  />
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Use of <code>jQuery.noConflict()</code></h2>
<div class="outline-text-2" id="text-1">
<p>
To make the program more robust and avoid clash between variables with that of running website
jQuery noConflict() is used and normal '$' selector is changed with '$j'.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock1">  var $j = jQuery.noConflict();
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Calling annolet<sub>main</sub>() function</h2>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Function <code>annolet_createContainer()</code></h2>
<div class="outline-text-2" id="text-3">
<p>
This function creates a continer div which let the users interact with app.
When <code>annolet_createContainer</code> is called, it injects CSS stylesheet into <code>&lt;head&gt;</code> 
element of website to stylize the container and <code>&lt;div id=annolet-container&gt;...&lt;/div&gt;</code> 
whose inner HTML is a list of options inside <code>body</code>.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock2">var annolet_btn;
// function to create annolet controls container
function annolet_createContainer() {
    // appending a CSS stylesheet to head of webpage
    var link = document.createElement('link');
    // using rawgit.com MaxCDN.. files directly linked to git repo 'annoletjs/master'
    link.href = "https://cdn.rawgit.com/SSS-Studio-development/annoletjs/master/annolet.css"; //random version number removed bcoz some browser take it as text file and not as CSS.
    link.type = "text/css";
    link.rel = "stylesheet";
    document.getElementsByTagName('head')[0].appendChild(link);

    // appending a div to body of webpage
    var body = document.getElementsByTagName('body')[0];
    var annolet_container = document.createElement('div');
    annolet_container.id = 'annolet-container';
    body.appendChild(annolet_container);
    //injecting html code
    document.getElementById('annolet-container').innerHTML = "&lt;ul id='annolet' class=annolet-tools-menu&gt;"+
    "&lt;span id='annolet' style='border-radius:10px;  color:orange;font-weight:bold;font-family:monospace; font-size:1.3em'&gt;AnnoLet!&lt;/span&gt;"+
    "&lt;span id='annolet' style='color:grey;'&gt;|&lt;/span&gt;"+
    "&lt;li id='annolet' class=annolet-tools-menu-item id=highlight-btn onclick='annolet_btn=1;'&gt;TagIt!&lt;/li&gt;"+
    "&lt;li id='annolet' class=annolet-tools-menu-item id=exit-btn onclick='annolet_btn=0;'&gt;exit&lt;/li&gt;"+
    "&lt;/ul&gt;"; //HTML to create a list of options
}
</pre>
</div>
<p class="verse">
&#xa0;<span class="underline">The container div contains following options</span><br  />
- <i>tagit</i>: to start tagging DOM elements. It will also highlight clicked element. On click <code>annolet_btn</code> is changed to 1.<br  />
- <i>exit</i>: to stop all functions and remove container from body. On click <code>annolet_btn</code> is changed to 0.<br  />
</p>
<hr  />
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> Functions to retrieve and evaluate Xpath of seleceted DOM element</h2>
<div class="outline-text-2" id="text-4">
<p>
These functions are copied from <a href="https://code.google.com/p/fbug/source/browse/branches/firebug1.6/content/firebug/lib.js?spec=svn12950&amp;r=8828#1332">Mozilla Firebug Opensource Code</a>. Implemented  with small changes.
</p>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">4.1</span> Function <code>anno_getXpath(target)</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
It returns string containing Xpath of selected element which is passed as an argument called <code>target</code>.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock3">// function to get Xpath to passed element
function anno_getXpathTo(element) {
    if (element.id !== '') {
        return "//*[@id='" + element.id + "']";
    }
    if (element === document.body) {
        return "html/" + element.tagName.toLowerCase();
    } //added 'html/' to generate a valid Xpath even if parent has no ID.
    var ix = 0;
    var siblings = element.parentNode.childNodes;
    for (var i = 0; i &lt; siblings.length; i++) {
        var sibling = siblings[i];
        if (sibling === element) {
            return anno_getXpathTo(element.parentNode) + '/' + element.tagName.toLowerCase() + '[' + (ix + 1) + ']';
        }
        if (sibling.nodeType === 1 &amp;&amp; sibling.tagName === element.tagName) {
            ix++;
        }
    }
}
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.2</span> Function <code>anno_getElementByXpath(xpath)</code></h3>
<div class="outline-text-3" id="text-4-2">
<p>
This function returns that element as object whose Xpath is passed as an argument through it.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock4">// function to evaluate element from Xpath
function anno_getElementByXpath(xpath) {
    return document.evaluate(xpath, document, null, XPathResult.FIRST_ORDERED_NODE_TYPE, null).singleNodeValue;
}
</pre>
</div>
<hr  />
</div>
</div>
</div>
<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">5</span> Selecting, highlighting and tagging an element</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">5.1</span> Function <code>annolet_main()</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>annolet_main()</code> is main function which will on execution calls <code>annolet_createContainer()</code> and monitors document
for mouse clicks. On click, clicked element is selected as target which is passed through
function <code>annolet_getXpath</code> and returned Xpath is stored in variable <code>xpath</code>.
<code>annolet_main()</code> function always check for the current value of <code>annolet_btn</code> whenever user clicks.
On the bases of this value, preffered function <code>anno_highlight()</code> for 1 is called. More option will be added later.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock5">//main function which will execute other functions
function annolet_main() {
    disableAllLinks()  // it will disable all the links present in webpage iteratively
    annolet_createContainer();
    document.onclick = function(event) {
        if (event === undefined) {
            event = window.event;
        } // for IE
        var target = 'target' in event ? event.target : event.srcElement; // for IE
        var root = document.compatMode === 'CSS1Compat' ? document.documentElement : document.body;
        var xpath = anno_getXpathTo(target);
        if (annolet_btn === 1) {
            anno_highlight(xpath);
        }
    };
}
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">5.2</span> Function <code>disableAllLinks()</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
This function iterates through all the links (<code>&lt;a&gt;</code> tags) and disable them so 
that user will not go out of webpage while annotating webpage.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock6">// funtion to disable all links
function disableAllLinks(){
    var anchors = document.getElementsByTagName("a");
    for (var i = 0; i &lt; anchors.length; i++) {
        anchors[i].onclick = function() {return(false);};
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">5.3</span> Function <code>annolet_insertIntoObject(xpath)</code></h3>
<div class="outline-text-3" id="text-5-3">
<p>
This function will create an object called <code>annolet_obj</code> which will contain authorname(username), url(which is annotated) 
and array of xpaths with tagName and tagType(like language, point of view). Everytime user clicks element, this function will run, so
as to assure that all the work done is saved for retreival in future. Xpath is passed through it as argument. Function tagObject is used
to push tagging information to tags array.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock7">//function to store tags into JSON object.
var annolet_obj = 0; //will save jason objects
function annolet_insertIntoObject(xpath) {
  if(annolet_obj==0){
    authorname = prompt('enter authorname');
    annolet_obj = {
        url: window.location.href,
        authorname: authorname,
        tags : []
    };
    tagObject(xpath, annolet_obj);
  }
  else {
    tagObject(xpath, annolet_obj);
  }
}
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">5.4</span> Function <code>function tagObject(xpath, obj)</code></h3>
<div class="outline-text-3" id="text-5-4">
<p>
This function asks user for tagging information and push it to tags array of <code>annolet_obj</code>.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock8">function tagObject(xpath, obj){
  tagName = prompt('tagName:');
  tagInfo = prompt('tagInfo');
  obj.tags.push(
    {
      tagName: tagName,
      tagInfo: tagInfo,
      xpath: xpath
    }
  )
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">5.5</span> Function <code>anno_highlight(xpath)</code></h3>
<div class="outline-text-3" id="text-5-5">
<p>
This function takes <code>xpath</code> as argument. Xpath of an element is passed to <code>anno_getElementByXpath(xpath)</code>
which returns element in obect form. Then that object is selected using jQuery and using <code>wrapInner()</code> function 
of jQuery it is wrapped inside <code>&lt;span&gt;</code> with id 'mark' and yellow background. Another function that is 
<code>annolet_insertIntoObject()</code> creates an object and push it to object array.So it can be saved for future to a 
server. It also prevents annolet container from highlighting itself.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock9">//function for highlighting element
function anno_highlight(xpath) {
    clicked_element = anno_getElementByXpath(xpath)
    //if element is already highlighted
    if (clicked_element.id == "mark" || clicked_element.id == "annolet") {
        console.log('not permitted');
    }
    else {
      // hightlight selected element and store it
      $j(anno_getElementByXpath(xpath)).wrapInner("&lt;span id='mark' style='background:yellow;'&gt;&lt;/span&gt;");
      annolet_insertIntoObject(xpath); // storing into object
    }
}
</pre>
</div>
<hr  />
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">5.6</span> Function <code>anno_annotate()</code></h3>
<div class="outline-text-3" id="text-5-6">
</div><div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">5.6.1</span> <i>not complete</i></h4>
<div class="outline-text-4" id="text-5-6-1">
<p>
In this function I will use some functionality of <code>annolet_highlight()</code> function, then another function which will create 
a div containing <code>textarea</code>. This box will add to fixed div which will slide up. There will be two options in that box, 
1.save 
2.cancel. 
On clicking save, the content variable will become equal to the textarea value and then <code>annolet_pushToStack()</code> will be called. Right now there is no method for retrieval of annotations.
</p>
<div class="org-src-container">

<pre class="src src-js" id="orgsrcblock10">function anno_annotate(xpath){
if (anno_getElementByXpath(xpath).id != "mark" || !(anno_getElementByXpath(xpath).id)) {
        //adding orange coloured border around selected part.
        $j(anno_getElementByXpath(xpath)).wrapInner("&lt;span id='mark' style='border:solid 1px orange;'&gt;&lt;/span&gt;");
        annolet_pushToStack(xpath);
    } else {
        console.log('highlighted already');
    }
}
</pre>
</div>
<hr  />
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Raghav Mittal</p>
<p class="date">Created: 2016-06-17 Fri 10:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
